In [2]:
import pandas as pd

In [6]:
var = pd.DataFrame({"Name":["a","b","c","d","a","b","a","b","a","c","c","d"], "S1": [11,12,13,14,15,16,17,18,19,20,21,22],
                   "S2":[22,23,24,25,26,27,28,29,30,31,32,33]})
var

   Name  S1  S2
0     a  11  22
1     b  12  23
2     c  13  24
3     d  14  25
4     a  15  26
5     b  16  27
6     a  17  28
7     b  18  29
8     a  19  30
9     c  20  31
10    c  21  32
11    d  22  33

In [8]:
var1 = var.groupby("Name")
var1

In [17]:
for x,y in var1:
    print(x)
    print(y)
    print()

a
  Name  S1  S2
0    a  11  22
4    a  15  26
6    a  17  28
8    a  19  30

b
  Name  S1  S2
1    b  12  23
5    b  16  27
7    b  18  29

c
   Name  S1  S2
2     c  13  24
9     c  20  31
10    c  21  32

d
   Name  S1  S2
3     d  14  25
11    d  22  33

In [15]:
var1.get_group("a")

  Name  S1  S2
0    a  11  22
4    a  15  26
6    a  17  28
8    a  19  30

In [20]:
var1.min()

      S1  S2
Name
a     11  22
b     12  23
c     13  24
d     14  25

In [22]:
var1.max()

      S1  S2
Name
a     19  30
b     18  29
c     21  32
d     22  33

In [24]:
var1.mean()

             S1         S2
Name
a     15.500000  26.500000
b     15.333333  26.333333
c     18.000000  29.000000
d     18.000000  29.000000

In [25]:
li = list(var1)
li

[('a',
    Name  S1  S2
  0    a  11  22
  4    a  15  26
  6    a  17  28
  8    a  19  30),
 ('b',
    Name  S1  S2
  1    b  12  23
  5    b  16  27
  7    b  18  29),
 ('c',
     Name  S1  S2
  2     c  13  24
  9     c  20  31
  10    c  21  32),
 ('d',
     Name  S1  S2
  3     d  14  25
  11    d  22  33)]